{
  "version": "2.0",
  "last_updated": "2026-02-18",
  "total_terms": 60,
  "categories": {
    "retirement": {
      "title": "Retirement Planning",
      "description": "Key terms for retirement savings, income planning, and benefit strategies",
      "terms": [
        {
          "term": "401(k)",
          "full_name": "401(k) Retirement Plan",
          "definition": "An employer-sponsored retirement savings plan that allows employees to contribute pre-tax dollars, reducing current taxable income. Many employers offer matching contributions up to a certain percentage.",
          "related_terms": ["Roth IRA", "IRA", "Defined Contribution Plan"],
          "see_also": ["/blog/retirement-planning-guide"]
        },
        {
          "term": "IRA",
          "full_name": "Individual Retirement Account",
          "definition": "A tax-advantaged savings account for retirement. Traditional IRAs offer tax-deductible contributions with taxable withdrawals, while Roth IRAs use after-tax contributions with tax-free withdrawals.",
          "related_terms": ["Roth IRA", "401(k)", "Tax-Deferred"],
          "see_also": ["/blog/retirement-planning-guide"]
        },
        {
          "term": "Roth IRA",
          "full_name": "Roth Individual Retirement Account",
          "definition": "A retirement account funded with after-tax dollars where qualified withdrawals in retirement are completely tax-free, including all investment gains. Subject to income limits for direct contributions.",
          "related_terms": ["IRA", "Tax-Exempt", "401(k)"],
          "see_also": ["/blog/roth-ira-guide"]
        },
        {
          "term": "RMD",
          "full_name": "Required Minimum Distribution",
          "definition": "The minimum amount you must withdraw annually from tax-deferred retirement accounts starting at age 73. Failure to take RMDs results in a 25% penalty on the amount not withdrawn.",
          "related_terms": ["IRA", "401(k)", "Tax-Deferred"],
          "see_also": []
        },
        {
          "term": "Social Security",
          "full_name": "Social Security Benefits",
          "definition": "A federal insurance program providing retirement income, disability benefits, and survivor benefits funded through payroll taxes. Benefits are based on your 35 highest-earning years.",
          "related_terms": ["COLA", "Pension", "Retirement Income"],
          "see_also": []
        },
        {
          "term": "Pension",
          "full_name": "Pension Plan",
          "definition": "A retirement plan where an employer guarantees a specific monthly benefit in retirement based on salary history and years of service. Also known as a defined benefit plan.",
          "related_terms": ["Defined Benefit Plan", "Social Security", "Annuity"],
          "see_also": []
        },
        {
          "term": "Defined Benefit Plan",
          "full_name": "Defined Benefit Pension Plan",
          "definition": "A retirement plan that promises a predetermined monthly benefit at retirement, typically calculated using a formula based on salary and years of service. The employer bears the investment risk.",
          "related_terms": ["Pension", "Defined Contribution Plan"],
          "see_also": []
        },
        {
          "term": "Defined Contribution Plan",
          "full_name": "Defined Contribution Retirement Plan",
          "definition": "A retirement plan where the employee and/or employer contribute a defined amount, but the final benefit depends on investment performance. Examples include 401(k) and 403(b) plans.",
          "related_terms": ["401(k)", "Defined Benefit Plan"],
          "see_also": []
        },
        {
          "term": "Annuity",
          "full_name": "Annuity Contract",
          "definition": "An insurance contract that provides guaranteed income payments for a specified period or for life. Can be immediate (payments start now) or deferred (payments start later). Used to create predictable retirement income.",
          "related_terms": ["Pension", "Retirement Income", "Cash Value"],
          "see_also": ["/blog/annuity-guide"]
        },
        {
          "term": "COLA",
          "full_name": "Cost-of-Living Adjustment",
          "definition": "An annual increase to Social Security and some pension benefits designed to keep pace with inflation, typically based on the Consumer Price Index (CPI).",
          "related_terms": ["Social Security", "Inflation", "Pension"],
          "see_also": []
        }
      ]
    },
    "insurance": {
      "title": "Insurance & Protection",
      "description": "Life insurance, disability, and asset protection terminology",
      "terms": [
        {
          "term": "IUL",
          "full_name": "Indexed Universal Life Insurance",
          "definition": "A permanent life insurance policy where the cash value growth is linked to a stock market index (like the S&P 500) with a guaranteed floor protecting against losses. Combines death benefit protection with tax-advantaged cash value accumulation.",
          "related_terms": ["Cash Value", "Death Benefit", "Whole Life"],
          "see_also": ["/blog/iul-guide"]
        },
        {
          "term": "Term Life",
          "full_name": "Term Life Insurance",
          "definition": "Life insurance that provides coverage for a specific period (10, 20, or 30 years). If the insured dies during the term, beneficiaries receive the death benefit. Generally the most affordable type of life insurance.",
          "related_terms": ["Death Benefit", "Whole Life", "Premium"],
          "see_also": []
        },
        {
          "term": "Whole Life",
          "full_name": "Whole Life Insurance",
          "definition": "Permanent life insurance with guaranteed level premiums, a guaranteed death benefit, and a guaranteed cash value that grows at a fixed rate. Provides lifelong coverage as long as premiums are paid.",
          "related_terms": ["IUL", "Cash Value", "Term Life"],
          "see_also": []
        },
        {
          "term": "Cash Value",
          "full_name": "Cash Value Life Insurance",
          "definition": "The savings component of a permanent life insurance policy that grows tax-deferred over time. Can be accessed through policy loans or withdrawals for supplemental retirement income or emergencies.",
          "related_terms": ["IUL", "Whole Life", "Tax-Deferred"],
          "see_also": []
        },
        {
          "term": "Death Benefit",
          "full_name": "Life Insurance Death Benefit",
          "definition": "The amount paid to beneficiaries upon the death of the insured person. Generally received income-tax-free by beneficiaries and can be used for any purpose.",
          "related_terms": ["Beneficiary", "Term Life", "IUL"],
          "see_also": []
        },
        {
          "term": "Living Benefits",
          "full_name": "Accelerated Living Benefits",
          "definition": "Life insurance riders that allow the policyholder to access a portion of the death benefit while still alive if diagnosed with a terminal, chronic, or critical illness.",
          "related_terms": ["Death Benefit", "Long-Term Care", "IUL"],
          "see_also": []
        },
        {
          "term": "Long-Term Care",
          "full_name": "Long-Term Care Insurance",
          "definition": "Insurance that covers the cost of extended care services not covered by health insurance or Medicare, including nursing home care, assisted living, and in-home care.",
          "related_terms": ["Living Benefits", "Disability Insurance"],
          "see_also": []
        },
        {
          "term": "Disability Insurance",
          "full_name": "Disability Income Insurance",
          "definition": "Insurance that replaces a portion of your income if you become unable to work due to illness or injury. Can be short-term (up to 2 years) or long-term (to age 65+).",
          "related_terms": ["Long-Term Care", "Premium"],
          "see_also": []
        },
        {
          "term": "Premium",
          "full_name": "Insurance Premium",
          "definition": "The regular payment made to an insurance company to maintain coverage. Premiums vary based on age, health, coverage amount, and policy type.",
          "related_terms": ["Underwriting", "Term Life", "IUL"],
          "see_also": []
        },
        {
          "term": "Underwriting",
          "full_name": "Insurance Underwriting",
          "definition": "The process by which an insurance company evaluates the risk of insuring an applicant, determining eligibility and premium rates based on health, lifestyle, and other factors.",
          "related_terms": ["Premium", "Term Life"],
          "see_also": []
        }
      ]
    },
    "tax": {
      "title": "Tax Strategy",
      "description": "Tax planning, optimization, and regulatory terminology",
      "terms": [
        {
          "term": "Tax-Deferred",
          "full_name": "Tax-Deferred Growth",
          "definition": "An investment arrangement where taxes on earnings are postponed until funds are withdrawn, typically in retirement. Examples include traditional IRAs, 401(k)s, and annuities.",
          "related_terms": ["Tax-Exempt", "IRA", "401(k)"],
          "see_also": []
        },
        {
          "term": "Tax-Exempt",
          "full_name": "Tax-Exempt Income",
          "definition": "Income or investment gains that are permanently free from federal income tax. Roth IRA qualified withdrawals and municipal bond interest are common examples.",
          "related_terms": ["Roth IRA", "Tax-Deferred"],
          "see_also": []
        },
        {
          "term": "Tax-Loss Harvesting",
          "full_name": "Tax-Loss Harvesting Strategy",
          "definition": "Selling investments at a loss to offset capital gains and reduce taxable income. Up to $3,000 in net losses can be deducted against ordinary income annually, with excess losses carried forward.",
          "related_terms": ["Capital Gains", "Rebalancing"],
          "see_also": []
        },
        {
          "term": "Capital Gains",
          "full_name": "Capital Gains Tax",
          "definition": "Tax on profit from selling an asset for more than its purchase price. Long-term gains (held over 1 year) are taxed at preferential rates of 0%, 15%, or 20% depending on income.",
          "related_terms": ["Tax-Loss Harvesting", "Qualified Dividend"],
          "see_also": []
        },
        {
          "term": "Marginal Tax Rate",
          "full_name": "Marginal Federal Tax Rate",
          "definition": "The tax rate applied to the last dollar of income earned. The U.S. uses a progressive system with brackets ranging from 10% to 37%, where only income within each bracket is taxed at that rate.",
          "related_terms": ["Capital Gains", "AMT"],
          "see_also": []
        },
        {
          "term": "Estate Tax",
          "full_name": "Federal Estate Tax",
          "definition": "A tax on the transfer of wealth at death. In 2026, estates exceeding the exemption amount (currently ~$13.6 million per individual) are taxed at rates up to 40%.",
          "related_terms": ["Gift Tax", "Trust", "Estate Plan"],
          "see_also": ["/blog/estate-planning-guide"]
        },
        {
          "term": "Gift Tax",
          "full_name": "Federal Gift Tax",
          "definition": "A tax on transferring assets to another person during your lifetime without receiving full value in return. Annual exclusion allows gifts up to $18,000 per recipient without tax consequences.",
          "related_terms": ["Estate Tax", "Trust"],
          "see_also": []
        },
        {
          "term": "1031 Exchange",
          "full_name": "Section 1031 Like-Kind Exchange",
          "definition": "A tax-deferral strategy allowing investors to sell an investment property and reinvest proceeds into a similar property while deferring capital gains taxes. Strict timelines and rules apply.",
          "related_terms": ["Capital Gains", "Tax-Deferred"],
          "see_also": []
        },
        {
          "term": "Qualified Dividend",
          "full_name": "Qualified Dividend Income",
          "definition": "Dividends from domestic and qualifying foreign corporations that meet specific holding period requirements and are taxed at the lower long-term capital gains rates rather than ordinary income rates.",
          "related_terms": ["Capital Gains", "Yield"],
          "see_also": []
        },
        {
          "term": "AMT",
          "full_name": "Alternative Minimum Tax",
          "definition": "A parallel tax system designed to ensure high-income taxpayers pay a minimum amount of tax by limiting certain deductions and exclusions. Calculated separately from regular income tax.",
          "related_terms": ["Marginal Tax Rate", "Tax-Loss Harvesting"],
          "see_also": []
        }
      ]
    },
    "investment": {
      "title": "Investment Terms",
      "description": "Core investment concepts and portfolio management terminology",
      "terms": [
        {
          "term": "Asset Allocation",
          "full_name": "Strategic Asset Allocation",
          "definition": "The process of dividing investments among different asset classes (stocks, bonds, cash, real estate) based on your goals, risk tolerance, and time horizon to optimize returns while managing risk.",
          "related_terms": ["Diversification", "Risk Tolerance", "Rebalancing"],
          "see_also": []
        },
        {
          "term": "Diversification",
          "full_name": "Portfolio Diversification",
          "definition": "Spreading investments across various asset classes, sectors, and geographies to reduce risk. The principle that a diversified portfolio tends to have less volatile returns than any single investment.",
          "related_terms": ["Asset Allocation", "Index Fund", "Risk Tolerance"],
          "see_also": []
        },
        {
          "term": "Dollar-Cost Averaging",
          "full_name": "Dollar-Cost Averaging Strategy",
          "definition": "An investment strategy of regularly investing a fixed dollar amount regardless of market conditions. This approach reduces the impact of volatility by buying more shares when prices are low and fewer when high.",
          "related_terms": ["Index Fund", "Compound Interest"],
          "see_also": []
        },
        {
          "term": "Fiduciary",
          "full_name": "Fiduciary Duty",
          "definition": "A legal obligation to act in the best interest of a client. Fiduciary advisors must put their clients' interests ahead of their own and disclose any conflicts of interest.",
          "related_terms": ["Asset Allocation", "Risk Tolerance"],
          "see_also": ["/blog/why-fiduciary-matters"]
        },
        {
          "term": "Index Fund",
          "full_name": "Index Fund / ETF",
          "definition": "A mutual fund or ETF designed to track the performance of a specific market index, such as the S&P 500. Offers broad market exposure with low fees and is a cornerstone of passive investing.",
          "related_terms": ["Diversification", "Dollar-Cost Averaging", "Yield"],
          "see_also": []
        },
        {
          "term": "Compound Interest",
          "full_name": "Compound Interest / Growth",
          "definition": "Interest earned on both the initial principal and previously accumulated interest. Often called the 'eighth wonder of the world,' compounding accelerates wealth growth over long time horizons.",
          "related_terms": ["Dollar-Cost Averaging", "Yield"],
          "see_also": []
        },
        {
          "term": "Risk Tolerance",
          "full_name": "Investment Risk Tolerance",
          "definition": "The degree of variability in investment returns that an individual is willing to withstand. Influenced by factors including age, income, financial goals, and personal comfort with market fluctuations.",
          "related_terms": ["Asset Allocation", "Diversification"],
          "see_also": []
        },
        {
          "term": "Rebalancing",
          "full_name": "Portfolio Rebalancing",
          "definition": "The process of realigning the weightings of portfolio assets back to target allocations. Involves periodically buying or selling assets to maintain the desired level of asset allocation and risk.",
          "related_terms": ["Asset Allocation", "Tax-Loss Harvesting"],
          "see_also": []
        },
        {
          "term": "Yield",
          "full_name": "Investment Yield",
          "definition": "The income return on an investment, expressed as a percentage of the investment's cost or current market value. Includes dividends from stocks and interest from bonds.",
          "related_terms": ["Qualified Dividend", "Compound Interest", "Liquidity"],
          "see_also": []
        },
        {
          "term": "Liquidity",
          "full_name": "Asset Liquidity",
          "definition": "The ease with which an asset can be converted to cash without significantly affecting its price. Cash is the most liquid asset, while real estate and certain investments are less liquid.",
          "related_terms": ["Emergency Fund", "Cash Flow", "Yield"],
          "see_also": []
        }
      ]
    },
    "estate": {
      "title": "Estate Planning",
      "description": "Wealth transfer, trusts, and legacy planning terminology",
      "terms": [
        {
          "term": "Trust",
          "full_name": "Trust Agreement",
          "definition": "A legal arrangement where a trustee holds and manages assets on behalf of beneficiaries according to terms set by the grantor. Trusts can avoid probate, reduce estate taxes, and protect assets.",
          "related_terms": ["Irrevocable Trust", "Revocable Trust", "Beneficiary"],
          "see_also": ["/blog/estate-planning-guide"]
        },
        {
          "term": "Will",
          "full_name": "Last Will and Testament",
          "definition": "A legal document that specifies how a person's assets should be distributed after death, names guardians for minor children, and designates an executor to manage the estate.",
          "related_terms": ["Probate", "Beneficiary", "Estate Plan"],
          "see_also": []
        },
        {
          "term": "Beneficiary",
          "full_name": "Designated Beneficiary",
          "definition": "A person or entity designated to receive assets from an insurance policy, retirement account, trust, or estate. Beneficiary designations typically override instructions in a will.",
          "related_terms": ["Trust", "Death Benefit", "Will"],
          "see_also": []
        },
        {
          "term": "Power of Attorney",
          "full_name": "Durable Power of Attorney",
          "definition": "A legal document authorizing someone to act on your behalf for financial or healthcare decisions if you become incapacitated. A 'durable' POA remains in effect during incapacity.",
          "related_terms": ["Estate Plan", "Trust"],
          "see_also": []
        },
        {
          "term": "Probate",
          "full_name": "Probate Process",
          "definition": "The legal process of validating a will and distributing a deceased person's assets under court supervision. Can be time-consuming and expensive, which is why many people use trusts to avoid it.",
          "related_terms": ["Will", "Trust", "Beneficiary"],
          "see_also": []
        },
        {
          "term": "Irrevocable Trust",
          "full_name": "Irrevocable Trust Agreement",
          "definition": "A trust that generally cannot be modified or terminated after creation without the beneficiaries' consent. Assets placed in an irrevocable trust are removed from the grantor's taxable estate.",
          "related_terms": ["Revocable Trust", "Estate Tax", "Trust"],
          "see_also": []
        },
        {
          "term": "Revocable Trust",
          "full_name": "Revocable Living Trust",
          "definition": "A trust that can be modified or dissolved by the grantor during their lifetime. Primarily used to avoid probate and provide seamless management of assets if the grantor becomes incapacitated.",
          "related_terms": ["Irrevocable Trust", "Probate", "Trust"],
          "see_also": []
        },
        {
          "term": "Estate Plan",
          "full_name": "Comprehensive Estate Plan",
          "definition": "A collection of legal documents and strategies for managing and distributing assets during life and after death. Typically includes a will or trust, powers of attorney, and healthcare directives.",
          "related_terms": ["Trust", "Will", "Power of Attorney"],
          "see_also": ["/blog/estate-planning-guide"]
        },
        {
          "term": "Successor Trustee",
          "full_name": "Successor Trustee Designation",
          "definition": "The person or institution named to take over management of a trust when the original trustee can no longer serve, either due to incapacity or death.",
          "related_terms": ["Trust", "Revocable Trust"],
          "see_also": []
        },
        {
          "term": "Charitable Remainder Trust",
          "full_name": "Charitable Remainder Trust (CRT)",
          "definition": "An irrevocable trust that provides income to the donor or beneficiaries for a specified period, with the remaining assets going to a designated charity. Offers income tax deductions and estate tax benefits.",
          "related_terms": ["Irrevocable Trust", "Estate Tax", "Gift Tax"],
          "see_also": []
        }
      ]
    },
    "general": {
      "title": "General Finance",
      "description": "Foundational financial concepts and personal finance terminology",
      "terms": [
        {
          "term": "Net Worth",
          "full_name": "Personal Net Worth",
          "definition": "The total value of all assets minus all liabilities. A key measure of financial health that includes property, investments, cash, and retirement accounts minus debts like mortgages and loans.",
          "related_terms": ["Cash Flow", "Equity"],
          "see_also": []
        },
        {
          "term": "Cash Flow",
          "full_name": "Personal Cash Flow",
          "definition": "The total amount of money coming in (income) minus money going out (expenses) over a specific period. Positive cash flow enables saving, investing, and building wealth over time.",
          "related_terms": ["Net Worth", "Emergency Fund", "Debt-to-Income Ratio"],
          "see_also": []
        },
        {
          "term": "Emergency Fund",
          "full_name": "Emergency Savings Fund",
          "definition": "A readily accessible savings reserve, typically 3-6 months of living expenses, set aside for unexpected financial needs such as job loss, medical emergencies, or major repairs.",
          "related_terms": ["Cash Flow", "Liquidity"],
          "see_also": []
        },
        {
          "term": "Debt-to-Income Ratio",
          "full_name": "Debt-to-Income Ratio (DTI)",
          "definition": "A personal finance metric calculated by dividing total monthly debt payments by gross monthly income. Lenders use DTI to assess borrowing capacity; generally, a DTI below 36% is considered healthy.",
          "related_terms": ["Credit Score", "Cash Flow"],
          "see_also": []
        },
        {
          "term": "Credit Score",
          "full_name": "FICO Credit Score",
          "definition": "A three-digit number (300-850) representing creditworthiness, calculated from payment history, credit utilization, length of credit history, credit mix, and new credit inquiries.",
          "related_terms": ["Debt-to-Income Ratio", "APR/APY"],
          "see_also": []
        },
        {
          "term": "Inflation",
          "full_name": "Consumer Price Inflation",
          "definition": "The rate at which the general level of prices for goods and services rises over time, eroding purchasing power. A critical factor in retirement planning, as it reduces the real value of savings.",
          "related_terms": ["COLA", "Compound Interest"],
          "see_also": []
        },
        {
          "term": "APR/APY",
          "full_name": "Annual Percentage Rate / Annual Percentage Yield",
          "definition": "APR is the annual cost of borrowing without compounding. APY is the annual return on savings including compound interest. APY is always equal to or higher than APR due to compounding effects.",
          "related_terms": ["Compound Interest", "Credit Score"],
          "see_also": []
        },
        {
          "term": "Amortization",
          "full_name": "Loan Amortization",
          "definition": "The process of spreading loan payments over time in regular installments. Early payments are mostly interest, while later payments apply more to principal—a concept important for mortgages and large loans.",
          "related_terms": ["Equity", "APR/APY"],
          "see_also": []
        },
        {
          "term": "Equity",
          "full_name": "Home Equity / Ownership Equity",
          "definition": "The difference between an asset's market value and the outstanding balance of any loans against it. In homeownership, equity builds as mortgage principal is paid down and/or property value increases.",
          "related_terms": ["Net Worth", "Amortization"],
          "see_also": []
        },
        {
          "term": "Human Life Value",
          "full_name": "Human Life Value (HLV)",
          "definition": "An economic concept measuring the monetary value of an individual's future earning potential, used to determine appropriate life insurance coverage. Factors include age, income, benefits, and expenses.",
          "related_terms": ["Death Benefit", "Term Life", "IUL"],
          "see_also": ["/blog/life-insurance-guide"]
        }
      ]
    }
  }
}
